---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.TemporaryChangesTransparentPermissions
source: html/c2e15c5a-0e8b-ccc6-ec9a-4cce0a28faf5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.TemporaryChangesTransparentPermissions Property

Permission to edit the element cannot be obtained. Changes will be temporary, and will not be saved.

## Syntax (C#)
```csharp
public static FailureDefinitionId TemporaryChangesTransparentPermissions { get; }
```